IDEA StatiCa Open Model
SubStructureGeometry.ConnectionPoints Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Array of connection points
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<ReferenceElement> ConnectionPoints { get; set; }
Public Property ConnectionPoints As List(Of ReferenceElement)
	Get
	Set
public:
property List<ReferenceElement^>^ ConnectionPoints {
	List<ReferenceElement^>^ get ();
	void set (List<ReferenceElement^>^ value);
}
Return Value
Type: List<ReferenceElement>
List of ConnectionPoints
See Also
Reference
SubStructureGeometry Class
IdeaRS.OpenModel.Model Namespace